app/controllers/short_urls_controller.rb

  def index
    render status: 200, json: { urls: ShortUrl.all }
---
SELECT `short_urls`.* FROM `short_urls`

  def create
    url = ShortUrl.find_by( full_url: params[:full_url] )

    if url
      render status: 200, json: { short_code: url.short_code }
    else
      url = ShortUrl.create( full_url: params[:full_url] )

      if url.save
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`full_url` = 'https://google4.com' LIMIT 1
INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('https://google4.com', '2022-11-04 22:54:41.918670', '2022-11-04 22:54:41.918670')
UPDATE `short_urls` SET `short_urls`.`title` = 'google8.com', `short_urls`.`updated_at` = '2022-11-04 23:23:35.892486' WHERE `short_urls`.`id` = 9

  def show
    url_code = ShortUrl.find_by( url_code: params[:id] )

    if url_code
      clicks_count = url_code.click_count + 1
      url_code.update_attributes( :click_count => clicks_count )
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`url_code` = 'delegateExpenses/d' LIMIT 1
UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2022-11-06 21:41:47.204649' WHERE `short_urls`.`id` = 1