app/controllers/short_urls_controller.rb

  def index
    urls = ShortUrl.limit( 100 ).order('click_count desc').map { |short_code| short_code.short_code }
---
SELECT `short_urls`.* FROM `short_urls` ORDER BY click_count desc LIMIT 100