app/models/short_url.rb

  def short_code
    number = self.id
    url_code = ""

    while number > 0
      result = number % 62
      url_code.prepend( CHARACTERS[result] )
      number = ( number / 62 ).floor
    end

    self.url_code = url_code
    self.save
---
UPDATE `short_urls` SET `short_urls`.`url_code` = 'b', `short_urls`.`updated_at` = '2022-11-05 00:05:26.499925' WHERE `short_urls`.`id` = 11

  def update_title!
    new_title = full_url.split("//")[1].split('/')[0]
    self.title = new_title
    self.save
---
UPDATE `short_urls` SET `short_urls`.`title` = 'www.youtobe.com', `short_urls`.`updated_at` = '2022-11-06 23:39:57.358757' WHERE `short_urls`.`id` = 19