app/jobs/update_title_job.rb

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 1 LIMIT 1
---
  def perform(short_url_id)
    url = ShortUrl.find_by(id: short_url_id)